Ran Plan for project: `test-atlantis` dir: `examples` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.base-svc.kong_route.route["all_route"] will be created
+ resource "kong_route" "route" {
      + hosts          = [
          + "basesvc.example.com",
          + "base1.svc.example.com",
        ]
      + id             = (known after apply)
      + name           = "all_route"
      + paths          = [
          + "/",
        ]
      + preserve_host  = false
      + protocols      = [
          + "http",
          + "https",
        ]
      + regex_priority = 0
      + service_id     = (known after apply)
      + strip_path     = true
    }

  # module.base-svc.kong_service.service will be created
+ resource "kong_service" "service" {
      + connect_timeout = 60000
      + host            = "base-svc-service"
      + id              = (known after apply)
      + name            = "base-svc"
      + path            = "/"
      + port            = 80
      + protocol        = "http"
      + read_timeout    = 60000
      + retries         = 0
      + write_timeout   = 60000
    }

  # module.base-svc.kong_target.target["base-svc.cluster.local:8001"] will be created
+ resource "kong_target" "target" {
      + id          = (known after apply)
      + target      = "base-svc.cluster.local:8001"
      + upstream_id = (known after apply)
      + weight      = 100
    }

  # module.base-svc.kong_upstream.upstream will be created
+ resource "kong_upstream" "upstream" {
      + hash_fallback       = "none"
      + hash_on             = "none"
      + hash_on_cookie_path = "/"
      + id                  = (known after apply)
      + name                = "base-svc-service"
      + slots               = 10000

      + healthchecks {
          + active {
              + concurrency              = (known after apply)
              + http_path                = (known after apply)
              + https_sni                = (known after apply)
              + https_verify_certificate = (known after apply)
              + timeout                  = (known after apply)
              + type                     = (known after apply)

              + healthy {
                  + http_statuses = (known after apply)
                  + interval      = (known after apply)
                  + successes     = (known after apply)
                }

              + unhealthy {
                  + http_failures = (known after apply)
                  + http_statuses = (known after apply)
                  + interval      = (known after apply)
                  + tcp_failures  = (known after apply)
                  + timeouts      = (known after apply)
                }
            }

          + passive {
              + type = (known after apply)

              + healthy {
                  + http_statuses = (known after apply)
                  + successes     = (known after apply)
                }

              + unhealthy {
                  + http_failures = (known after apply)
                  + http_statuses = (known after apply)
                  + tcp_failures  = (known after apply)
                  + timeouts      = (known after apply)
                }
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p test-atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](http://8ce8d053ca65:4141/lock?id=vaibhavkhurana2018%252Fterraform-kong-kong-module%252Fexamples%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p test-atlantis`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
